workspace/InformationRegisters/АукИсторияСтатусовАукционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АукИсторияСтатусовАукционов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АукСтатусыАукционов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Аукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

workspace/InformationRegisters/АукИсторияКомандАукционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АукИсторияКомандАукционов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автоматическая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукКаналыВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючРодителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиУникальности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АукРезультатыВыполненияКоманд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АукКоманды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукКонтактныеЛицаУчастниковАукционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КлючКоманды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиУникальности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

workspace/CommonModules/АукУправлениеАукционамиВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗапуститьКонтрольСостоянияАукционовФоново() Экспорт
	
	//АукУправлениеАукционамиСервер.КонтрольСостоянияАукционов();
	
	АукУправлениеАукционамиСервер.КонтрольВыполненияКоманд();
	
	АукУправлениеАукционамиСервер.КонтрольСостоянияАукционов();
	
КонецПроцедуры

// Отправка сообщений участникам. Происходит создание команд и их выполнение
//
// Параметры:
//  пСткПараметры
//		*Адресаты		- Массив структур
//			**Участник			- Справочник.АукУчастникиАукционов 
//			**КонтактноеЛицо	- Справочник.АукКонтактныеЛицаУчастниковАукционов
//		*Аукцион		- Справочник.АукАукционы 
//		*ТекстСообщения - Строка - отсылаемое сообщение
//		*Автоматическая - Булево - признак интеративной отправки
//		*ВидСообщения	- Перечисление.АукВидыСообщений
//
Процедура ОтправитьСообщениеУчастникам(пСткПараметры) Экспорт
	
	// 1. Получить данные рассылки
	масСообщенияУчастникам = АукУправлениеАукционамиСервер.ОтправкаПростогоСообщенияУчастникам_ДанныеРассылки(пСткПараметры);
	
	пСткПараметры.Вставить("СообщенияУчастникам", масСообщенияУчастникам);
	пСткПараметры.Вставить("НомерЭтапа", 		  РегистрыСведений.АукИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пСткПараметры.Аукцион).НомерЭтапа);
	
	// 2. Создание команд
	Попытка
		АукУправлениеАукционамиСервер.ОтправитьСообщенияУчастникам_СозданиеКоманд_(пСткПараметры);	
	Исключение
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Команды на отправку не были сформированы. Причина: %1'"), ОписаниеОшибки());
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		
		Возврат;	
	КонецПопытки;	
	
	// 3. Выполнить команды
	Если пСткПараметры.Свойство("КлючиКоманд") И ЗначениеЗаполнено(пСткПараметры.КлючиКоманд) Тогда
		
		масДанныеКоманд = РегистрыСведений.АукИсторияКомандАукционов.ДанныеКомандПоКлючам(пСткПараметры.КлючиКоманд);
		
		Для Каждого ЭлДанныеКоманды Из масДанныеКоманд Цикл
			сткРез = АукУправлениеАукционамиСервер.ПроизвестиКонтрольДанныхИВыполнитьКоманду(ЭлДанныеКоманды);
			
			Если Не сткРез.Успех Тогда	
				ТекстОшибки = СтрШаблон(НСтр("ru = 'Для контактного лица <%1> создана команда отправки сообщения, но не была выполнена. Причина: %2'"),
													ЭлДанныеКоманды.КонтактноеЛицо, сткРез.Результат);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);	
			КонецЕсли;	
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

// Получение данных от участников (сообщения, ставки, отказы)
//
// Параметры:
//  пСткПараметры
//	  Обязательные:
//		*Аукцион			- Справочник.АукАукционы 
//		*КонтактноеЛицо		- Справочник.АукКонтактныеЛицаУчастниковАукционов 
//		*Участник			- Справочник.АукУчастникиАукционов
//		*Данные 			- Произвольно. Может быть текст (отказ, сообщение) или массив структур (ставка)
//		*Автоматическая 	- Булево - признак интеративной отправки
//		*ВидДанных 			- Перечисление.АукВидыДанных
//		*ТребуетсяПодтверждение 	- Булево - признак необходимости оповещать участника о приеме от него данных
//	  Опциональные:
//		*ВидСообщения		- Перечисление.АукВидыСообщений - вид сообщения, которое необходимо отправить участнику (обязательно если ТребуетсяПодтверждение = Истина) 
//
Процедура ПолучитьДанныеОтУчастника(пСткПараметры) Экспорт
		
	// 1. Создание команды
	Попытка
		АукУправлениеАукционамиСервер.ПолучитьДанныеОтУчастника_СозданиеКоманды(пСткПараметры);	
	Исключение
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Данные от контактного лица <%1> не были зафиксированы. Причина: %2'"),
										пСткПараметры.КонтактноеЛицо, ОписаниеОшибки());
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);	
	КонецПопытки;
	
	// 2. Выполнение команды по ключу
	Если пСткПараметры.Свойство("КлючиКоманд") И ЗначениеЗаполнено(пСткПараметры.КлючиКоманд) Тогда	
		масДанныеКоманд = РегистрыСведений.АукИсторияКомандАукционов.ДанныеКомандПоКлючам(пСткПараметры.КлючиКоманд);
		
		Для Каждого ЭлДанныеКоманды Из масДанныеКоманд Цикл
			сткРез = АукУправлениеАукционамиСервер.ПроизвестиКонтрольДанныхИВыполнитьКоманду(ЭлДанныеКоманды);
			
			Если Не сткРез.Успех Тогда	
				ТекстОшибки = СтрШаблон(НСтр("ru = 'Для контактного лица <%1> создана команда ввода данных, но не была выполнена. Причина: %2'"),
											пСткПараметры.КонтактноеЛицо, сткРез.Результат);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				
				Возврат;
			КонецЕсли;	
		КонецЦикла;	
	Иначе	
		Возврат;
	КонецЕсли;	
	
	// 3. Выполнить оповещение участника о приеме данных (только для ставки и отказа). Если нужно
	Если пСткПараметры.ТребуетсяПодтверждение Тогда
		масДанныеКоманд = РегистрыСведений.АукИсторияКомандАукционов.ДанныеДочернихКоманд(пСткПараметры.КлючиКоманд);
		
		Для Каждого ЭлДанныеКоманды Из масДанныеКоманд Цикл
			сткРез = АукУправлениеАукционамиСервер.ПроизвестиКонтрольДанныхИВыполнитьКоманду(ЭлДанныеКоманды);
			
			Если Не сткРез.Успех Тогда	
				ТекстОшибки = СтрШаблон(НСтр("ru = 'Входящие данные контактного лица <%1> зафиксированы, но не выполнено оповещение. Причина: %2'"),
										пСткПараметры.КонтактноеЛицо, сткРез.Результат);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

// Перевод аукциона в работу. Происходит создание команд и их выполнение. Требуется возврат состояния
//
// Параметры:
//  пСткПараметры
//		*Аукцион		- Справочник.АукАукционы
//		*Автоматическая - Булево - признак интеративной отправки
//
Функция ПеревестиАукционВРаботу(пСткПараметры) Экспорт	
	// 1. Создание команды
	Попытка
		АукУправлениеАукционамиСервер.НачатьАукцион_СозданиеКоманды(пСткПараметры);
	Исключение
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Команда начала аукциона не была зафиксирована. Причина: %1'"), ОписаниеОшибки());
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		
		Возврат Ложь;
	КонецПопытки;
	
	// Такого вообще быть не должно, поэтому жестко кину исключение
	Если Не пСткПараметры.Свойство("КлючКоманды") Или Не ЗначениеЗаполнено(пСткПараметры.КлючКоманды) Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка ключа команды'");	
	КонецЕсли;	
	
	// 2. Выполнение команды по ключу	
	сткДанныеКоманды = РегистрыСведений.АукИсторияКомандАукционов.ДанныеКомандПоКлючам(пСткПараметры.КлючКоманды);
	
	сткРез = АукУправлениеАукционамиСервер.ПроизвестиКонтрольДанныхИВыполнитьКоманду(сткДанныеКоманды);
	
	Если Не сткРез.Успех Тогда	
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Команда начала аукциона была сформирована, но не была выполнена. Причина: %1'"), сткРез.Результат);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		
		Возврат Ложь;
	КонецЕсли;	
	
	// 3. Выполнить оповещение участников. Ошибки в оповещениях не должны тормозить аукцион!?
	масДанныеКоманд = РегистрыСведений.АукИсторияКомандАукционов.ДанныеДочернихКоманд(пСткПараметры.КлючКоманды);
	
	Для Каждого ЭлДанныеКоманды Из масДанныеКоманд Цикл
		сткРез = АукУправлениеАукционамиСервер.ПроизвестиКонтрольДанныхИВыполнитьКоманду(ЭлДанныеКоманды);
		
		Если Не сткРез.Успех Тогда	
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Аукцион начался. Контактное лицо <%1> не было проинформирвоано. Причина: %2'"),
										ЭлДанныеКоманды.КонтактноеЛицо, сткРез.Результат);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

// Перевод аукциона в архив. Происходит создание команд и их выполнение. Требуется возврат состояния
//
// Параметры:
//  пСткПараметры
//		*Аукцион		- Справочник.АукАукционы
//		*Автоматическая - Булево - признак интеративной отправки
//
Функция ПоместитьАукционВАрхив(пСткПараметры) Экспорт	
	// 1. Создание команды
	Попытка
		АукУправлениеАукционамиСервер.ПоместитьВАрхив_СозданиеКоманды(пСткПараметры);
	Исключение
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Команда начала аукциона не была зафиксирована. Причина: %1'"), ОписаниеОшибки());
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		
		Возврат Ложь;
	КонецПопытки;
	
	// Такого вообще быть не должно, поэтому жестко кину исключение
	Если Не пСткПараметры.Свойство("КлючКоманды") Или Не ЗначениеЗаполнено(пСткПараметры.КлючКоманды) Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка ключа команды'");	
	КонецЕсли;	
	
	// 2. Выполнение команды по ключу	
	сткДанныеКоманды = РегистрыСведений.АукИсторияКомандАукционов.ДанныеКомандПоКлючам(пСткПараметры.КлючКоманды);
	
	сткРез = АукУправлениеАукционамиСервер.ПроизвестиКонтрольДанныхИВыполнитьКоманду(сткДанныеКоманды);
	
	Если Не сткРез.Успех Тогда	
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Команда начала аукциона была сформирована, но не была выполнена. Причина: %1'"), сткРез.Результат);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Перевод аукциона на подведение промежуточных итогов. Происходит создание команд и их выполнение. Требуется возврат состояния
//
// Параметры:
//  пСткПараметры
//		*Аукцион		- Справочник.АукАукционы
//		*Автоматическая - Булево - признак интеративной отправки
//		*НомерЭтапа 	- Число
//
Функция ПерейтиКПодведениюПромежуточныхИтогов(пСткПараметры) Экспорт	
	// 1. Создание команды
	Попытка
		АукУправлениеАукционамиСервер.ПерейтиКПодведениюПромежуточныхИтогов_СозданиеКоманды(пСткПараметры);
	Исключение
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Команда перевода на новый этап не была зафиксирована. Причина: %1'"), ОписаниеОшибки());
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		
		Возврат Ложь;
	КонецПопытки;
	
	// Такого вообще быть не должно, поэтому жестко кину исключение
	Если Не пСткПараметры.Свойство("КлючКоманды") Или Не ЗначениеЗаполнено(пСткПараметры.КлючКоманды) Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка ключа команды'");	
	КонецЕсли;
	
	// 2. Выполнение команды по ключу	
	сткДанныеКоманды = РегистрыСведений.АукИсторияКомандАукционов.ДанныеКомандПоКлючам(пСткПараметры.КлючКоманды);
	
	сткРез = АукУправлениеАукционамиСервер.ПроизвестиКонтрольДанныхИВыполнитьКоманду(сткДанныеКоманды);
	
	Если Не сткРез.Успех Тогда	
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Команда перевода аукциона на новый этапа была сформирована, но не была выполнена. Причина: %1'"), сткРез.Результат);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		
		Возврат Ложь;
	КонецЕсли;	
	
	// 3. Выполнить оповещение участников.Ошибки в оповещениях не должны тормозить аукцион!?
	масДанныеКоманд = РегистрыСведений.АукИсторияКомандАукционов.ДанныеДочернихКоманд(пСткПараметры.КлючКоманды);
	
	Для Каждого ЭлДанныеКоманды Из масДанныеКоманд Цикл
		сткРез = АукУправлениеАукционамиСервер.ПроизвестиКонтрольДанныхИВыполнитьКоманду(ЭлДанныеКоманды);
		
		Если Не сткРез.Успех Тогда	
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Входящие данные контактного лица <%1> зафиксированы, но не выполнено оповещение. Причина: %2'"),
											ЭлДанныеКоманды.КонтактноеЛицо, сткРез.Результат);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

// Перевод аукциона на подведение окончательных итогов. Происходит создание команд и их выполнение. Требуется возврат состояния
//
// Параметры:
//  пСткПараметры
//		*Аукцион		- Справочник.АукАукционы
//		*Автоматическая - Булево - признак интеративной отправки
//		*НомерЭтапа 	- Число
//
Функция ПерейтиКПодведениюИтогов(пСткПараметры) Экспорт	
	// 1. Создание команды
	Попытка
		АукУправлениеАукционамиСервер.ПерейтиКПодведениюИтогов_СозданиеКоманды(пСткПараметры);
	Исключение
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Команда перевода на новый этап не была зафиксирована. Причина: %1'"), ОписаниеОшибки());
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		
		Возврат Ложь;
	КонецПопытки;
	
	// Такого вообще быть не должно, поэтому жестко кину исключение
	Если Не пСткПараметры.Свойство("КлючКоманды") Или Не ЗначениеЗаполнено(пСткПараметры.КлючКоманды) Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка ключа команды'");	
	КонецЕсли;
	
	// 2. Выполнение команды по ключу	
	сткДанныеКоманды = РегистрыСведений.АукИсторияКомандАукционов.ДанныеКомандПоКлючам(пСткПараметры.КлючКоманды);
	
	сткРез = АукУправлениеАукционамиСервер.ПроизвестиКонтрольДанныхИВыполнитьКоманду(сткДанныеКоманды);
	
	Если Не сткРез.Успех Тогда	
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Команда перевода аукциона на новый этапа была сформирована, но не была выполнена. Причина: %1'"), сткРез.Результат);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		
		Возврат Ложь;
	КонецЕсли;	
	
	// 3. Выполнить оповещение участников.Ошибки в оповещениях не должны тормозить аукцион!?
	масДанныеКоманд = РегистрыСведений.АукИсторияКомандАукционов.ДанныеДочернихКоманд(пСткПараметры.КлючКоманды);
	
	Для Каждого ЭлДанныеКоманды Из масДанныеКоманд Цикл
		сткРез = АукУправлениеАукционамиСервер.ПроизвестиКонтрольДанныхИВыполнитьКоманду(ЭлДанныеКоманды);
		
		Если Не сткРез.Успех Тогда	
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Входящие данные контактного лица <%1> зафиксированы, но не выполнено оповещение. Причина: %2'"),
											ЭлДанныеКоманды.КонтактноеЛицо, сткРез.Результат);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

// Фиксация промежуточных итогов аукциона. Требуется возврат состояния
//
// Параметры:
//  пСткПараметры
//	  Обязательные:
//		*Аукцион			- Справочник.АукАукционы 
//		*КонтактноеЛицо		- Справочник.АукКонтактныеЛицаУчастниковАукционов 
//		*Участник			- Справочник.АукУчастникиАукционов
//		*ДанныеСтавки 		- Массив структур
//			*ЭлементДанных			- Строка - тех. наименование
//			*ЗначениеЭлементаДанных - Произвольно
//		*Автоматическая 	- Булево - признак интеративной отправки
//		*НомерЭтапа 		- Число
//		*РасчетПоФормуле 	- Число
//		*ИтоговоеЗначение 	- Строка
//
Функция ЗафиксироватьПромежуточныеИтогиАукциона(пСткПараметры) Экспорт	
	// 1. Создание команды
	Попытка
		АукУправлениеАукционамиСервер.ЗафиксироватьПромежуточныеИтоги_СозданиеКоманды(пСткПараметры);	
	Исключение
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Команда фиксации промежуточных итогов не создана. Причина: %1'"), ОписаниеОшибки());
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		
		Возврат Ложь;	
	КонецПопытки;
	
	// Такого вообще быть не должно, поэтому жестко кину исключение
	Если Не пСткПараметры.Свойство("КлючКоманды") Или Не ЗначениеЗаполнено(пСткПараметры.КлючКоманды) Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка ключа команды'");	
	КонецЕсли;
	
	// 2. Выполнение команды по ключу
	сткДанныеКоманды = РегистрыСведений.АукИсторияКомандАукционов.ДанныеКомандПоКлючам(пСткПараметры.КлючКоманды);
	
	сткРез = АукУправлениеАукционамиСервер.ПроизвестиКонтрольДанныхИВыполнитьКоманду(сткДанныеКоманды);
	
	Если Не сткРез.Успех Тогда	
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Команда фиксации промежуточных итогов была сформирована, но не была выполнена. Причина: %1'"), сткРез.Результат);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		
		Возврат Ложь;	
	КонецЕсли;
	
	// 3. Выполнить оповещение участников
	масДанныеКоманд = РегистрыСведений.АукИсторияКомандАукционов.ДанныеДочернихКоманд(пСткПараметры.КлючКоманды);
	
	Для Каждого ЭлДанныеКоманды Из масДанныеКоманд Цикл	
		сткРез = АукУправлениеАукционамиСервер.ПроизвестиКонтрольДанныхИВыполнитьКоманду(ЭлДанныеКоманды);
		
		Если Не сткРез.Успех Тогда	
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Входящие данные контактного лица <%1> зафиксированы, но не выполнено оповещение. Причина: %2'"),
									ЭлДанныеКоманды.КонтактноеЛицо, сткРез.Результат);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);		
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат Истина;
КонецФункции

// Фиксация окончательных итогов аукциона.Требуется возврат состояния
//
// Параметры:
//  пСткПараметры
//	  Обязательные:
//		*Аукцион				- Справочник.АукАукционы 
//		*Автоматическая 		- Булево - признак интеративной отправки
//		*НачальныеУсловия		- Структура
//			**ОбщаяСумма		- Число
//			**ОбщийСрок			- Число
//		*ИтогиАукциона			- Массив стуктур
//			**Участник			- Справочник.АукУчастникиАукционов
//			**СтрокаДанных		- Число
//			**РаспределяемаяСумма	- Число
//			**ЭтоПобедитель		- Булево
//
Функция ЗафиксироватьОкончательныеИтогиАукциона(пСткПараметры) Экспорт	
	// 1. Создание команды
	Попытка
		АукУправлениеАукционамиСервер.ЗафиксироватьИтогиАукциона_СозданиеКоманды(пСткПараметры);	
	Исключение
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Команда фиксации окончательных итогов не создана. Причина: %2'"), ОписаниеОшибки());
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		
		Возврат Ложь;	
	КонецПопытки;
	
	// Такого вообще быть не должно, поэтому жестко кину исключение
	Если Не пСткПараметры.Свойство("КлючКоманды") Или Не ЗначениеЗаполнено(пСткПараметры.КлючКоманды) Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка ключа команды'");	
	КонецЕсли;
	
	// 2. Выполнение команды по ключу
	сткДанныеКоманды = РегистрыСведений.АукИсторияКомандАукционов.ДанныеКомандПоКлючам(пСткПараметры.КлючКоманды);
	
	сткРез = АукУправлениеАукционамиСервер.ПроизвестиКонтрольДанныхИВыполнитьКоманду(сткДанныеКоманды);
	
	Если Не сткРез.Успех Тогда	
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Команда фиксации окончательных была сформирована, но не была выполнена. Причина: %1'"), сткРез.Результат);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		
		Возврат Ложь;	
	КонецЕсли;
	
	// 3. Выполнить оповещение участников
	масДанныеКоманд = РегистрыСведений.АукИсторияКомандАукционов.ДанныеДочернихКоманд(пСткПараметры.КлючКоманды);
	
	Для Каждого ЭлДанныеКоманды Из масДанныеКоманд Цикл	
		сткРез = АукУправлениеАукционамиСервер.ПроизвестиКонтрольДанныхИВыполнитьКоманду(ЭлДанныеКоманды);
		
		Если Не сткРез.Успех Тогда	
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Входящие данные контактного лица <%1> зафиксированы, но не выполнено оповещение. Причина: %2'"),
										ЭлДанныеКоманды.КонтактноеЛицо, сткРез.Результат);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);		
		КонецЕсли;	
	КонецЦикла;		
		
	Возврат Истина;
КонецФункции

// Отмена проведения действующего аукциона. Требуется возврат состояния
//
// Параметры:
//  пСткПараметры
//		*Аукцион		- Справочник.АукАукционы
//		*Автоматическая - Булево - признак интеративной отправки
//
Функция ОтменитьАукцион(пСткПараметры) Экспорт	
	// 1. Создание команды
	Попытка
		АукУправлениеАукционамиСервер.ОтменитьАукцион_СозданиеКоманды(пСткПараметры);
	Исключение
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Команда перевода на новый этап не была зафиксирована. Причина: %1'"), ОписаниеОшибки());
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		
		Возврат Ложь;
	КонецПопытки;
	
	// Такого вообще быть не должно, поэтому жестко кину исключение
	Если Не пСткПараметры.Свойство("КлючКоманды") Или Не ЗначениеЗаполнено(пСткПараметры.КлючКоманды) Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка ключа команды'");	
	КонецЕсли;
	
	// 2. Выполнение команды по ключу	
	сткДанныеКоманды = РегистрыСведений.АукИсторияКомандАукционов.ДанныеКомандПоКлючам(пСткПараметры.КлючКоманды);
	
	сткРез = АукУправлениеАукционамиСервер.ПроизвестиКонтрольДанныхИВыполнитьКоманду(сткДанныеКоманды);
	
	Если Не сткРез.Успех Тогда	
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Команда перевода аукциона на новый этапа была сформирована, но не была выполнена. Причина: %1'"), сткРез.Результат);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		
		Возврат Ложь;
	КонецЕсли;	
	
	// 3. Выполнить оповещение участников.Ошибки в оповещениях не должны тормозить аукцион!?
	масДанныеКоманд = РегистрыСведений.АукИсторияКомандАукционов.ДанныеДочернихКоманд(пСткПараметры.КлючКоманды);
	
	Для Каждого ЭлДанныеКоманды Из масДанныеКоманд Цикл
		сткРез = АукУправлениеАукционамиСервер.ПроизвестиКонтрольДанныхИВыполнитьКоманду(ЭлДанныеКоманды);
		
		Если Не сткРез.Успех Тогда	
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Входящие данные контактного лица <%1> зафиксированы, но не выполнено оповещение. Причина: %2'"),
											ЭлДанныеКоманды.КонтактноеЛицо, сткРез.Результат);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Истина;
КонецФункции


#КонецОбласти
